{"page":{"title":"Swipe & Shop","slug":"swipe-and-shop","i18nSlugs":[{"locale":"en","value":"swipe-and-shop"},{"locale":"nl","value":"swipe-and-shop"}],"social":{"title":"Swipe & Shop | De Voorhoede","description":"Ontdek en shop nieuwe fashion met de hybride app Swipe & Shop","image":null},"keywords":"swipe, shop, tinder, fashion, mode, hybride, app, iOS, Android","heroIllustration":{"url":"https://www.datocms-assets.com/6524/1542187394-swipe-and-shop.svg","format":"svg","alt":"swipe en shop"},"caseTeaser":{"title":"Ontdek en shop nieuwe fashion met deze hybride app","image":{"url":"https://www.datocms-assets.com/6524/1539876093-swipe-and-shop.png","format":"png","alt":null,"width":749,"height":566}},"content":[{"__typename":"TextSectionRecord","title":"De uitdaging: Laat (meer dan) 80.000 vrouwen de kleding van hun dromen vinden","body":"<p>Apps zoals Tinder laten zien dat het goed werkt om gebruikers te belonen voor het verrichten van een kleine handeling. Swipe &amp; Shop is met die gedachte ontworpen. Want wie houdt er niet van om tijdens het wachten op de bus een beetje rond te swipen? Sinds de lancering van Swipe &amp; Shop dachten meer dan 80 duizend vrouwen precies hetzelfde.</p>\n<p>Swipe &amp; Shop is ontstaan als startup binnen het Sanoma Digital Lab. De app helpt gebruikers met het vinden van mode: het laat producten zien die je <em>liket</em> of <em>disliket</em>. De producten die je liket, komen in je <em>wishlist</em> te staan. De andere producten zie je niet meer terug. Om een product te kopen kan je vanuit de app direct naar de webshop navigeren.</p>\n<p>De doelgroep van Swipe &amp; Shop is jonge vrouwen tussen de 18 en 35 jaar. Het zijn digital natives: ze kennen hun weg op het web en binnen native apps en zijn kritisch op de gebruikerservaring. Aan ons de uitdaging om een app te bouwen die aan de hoge verwachtingen van deze doelgroep voldoet.</p>"},{"__typename":"TextSectionRecord","title":"De oplossing: een hybrid app","body":"<p>Swipe &amp; Shop is een hybrid app: geschreven in <strong>webtechnologie&euml;n</strong> zodat het kan draaien op elk platform. Doordat we maar <strong>&eacute;&eacute;n code base</strong> hoeven te onderhouden zijn de ontwikkeltijd en -kosten laag. Deze aanpak beperkt ons evenwel niet: de app heeft toegang tot <strong>native device features</strong>waarmee we bijvoorbeeld gebruik maken van push messages om direct met onze gebruikers te communiceren.</p>"},{"__typename":"ImageRecord","image":{"url":"https://www.datocms-assets.com/6524/1539876224-swipe-shop-devices.jpg","alt":null,"width":1230,"height":640,"format":"jpg"},"alt":"Swipe & Shop","fullWidth":false},{"__typename":"TextSectionRecord","title":"","body":"<p>Tijdens het project werkten we <strong>agile</strong> op locatie bij Sanoma. Hierdoor hadden we een nauwe samenwerking met Sanoma&rsquo;s designers en back-end developers. Doordat we al in een vroeg stadium bij het design waren betrokken, hadden we <strong>korte release cycles</strong> en weinig overhead.</p>\n<p>Samen met het Sanoma-team werkten we <strong>lean</strong>: het hele proces van design en development was gebaseerd op gebruikerstesten en -feedback. De gebruikers vertelden over features die ze misten of handig vonden. Door veel samen te werken met gebruikers, voelen zij zich actief bij de app betrokken en hebben we een <strong>actieve user base</strong>.</p>\n<p>Tijdens het project versoepelde Apple haar regels omtrent het downloaden van code binnen een app. We konden de app zelf de laatste code laten downloaden in plaats van de gebruiker een update uit de app store te laten halen. Hierdoor is de gebruiker <strong>altijd up-to-date</strong> met de laatste bug fixes en nieuwe features.</p>"}],"metaData":{"expertisesTitle":"Expertises","expertises":[{"title":"Development"}],"deliverableTitle":"Deliverables","deliverables":[{"title":"Hybrid web app"}],"technologiesTitle":"Platforms","technologies":[{"title":"AngularJS"},{"title":"Cordova"}],"interestedTitle":"","interestedLinkUrl":"","interestedLinkLabel":""},"quote":"","author":"","getInTouchTitle":"Neem contact op"},"pivots":[]}