{"page":{"title":"2dehands.be","slug":"2dehands-be","i18nSlugs":[{"locale":"en","value":"2dehands-be"},{"locale":"nl","value":"2dehands-be"}],"social":{"title":"2dehands.be | De Voorhoede","description":"De snelste marktplaats van België werkt op ieder apparaat door progressive enhancement","image":null},"keywords":"advertenties, marktplaats, tweedehands, progressive enhancement, browser scope, responsive, 2dehands.be","heroIllustration":{"url":"https://www.datocms-assets.com/6524/1539871378-2ehands.svg","format":"svg","alt":"tweede hands"},"caseTeaser":{"title":"De snelste marktplaats van België","image":{"url":"https://www.datocms-assets.com/6524/1539871533-2ehands.png","format":"png","alt":null,"width":1983,"height":1246}},"content":[{"__typename":"TextSectionRecord","title":"De uitdaging: snel een advertentie plaatsen vanaf elk apparaat","body":"<p>Op 2dehands.be kunnen bezoekers terecht voor het kopen en verkopen van tweedehands producten. Elke dag bezoeken 720.000 gebruikers de website en er staan maar liefst vier miljoen advertenties online. Daarmee is 2dehands.be de grootste gratis advertentiesite van Belgi&euml;.</p>\n<p>2dehands werkte, zoals de meeste sites, alleen goed op desktopcomputers en laptops. Door het grote bereik van de site, was het belangrijk dat de website ook goed werkt op mobiele apparaten met een kleiner scherm, zoals tablets en smartphones. 2dehands.be schakelde De Voorhoede in om de website geschikt te maken voor dit soort apparaten.</p>"},{"__typename":"ImageRecord","image":{"url":"https://www.datocms-assets.com/6524/1539871672-2dehands-devices.jpg","alt":null,"width":3868,"height":1540,"format":"jpg"},"alt":"2dehands.be","fullWidth":false},{"__typename":"TextSectionRecord","title":"","body":"<p>Daar hield de opdracht niet bij op: door het grote bezoekersaantal waren er ook grote verschillen in de ouderdom en snelheid van (mobiele) apparaten van bezoekers. Hierdoor moest het mogelijk zijn om met een oude Blackberry telefoon een advertentie te plaatsen via een trage 3G-verbinding. Daarnaast wil je gebruikers met een moderne smartphone of tablet een optimale gebruikerservaring bieden.</p>\n<p>Maar hoe bied je gebruikers met minder uitgeruste apparaten een website die 'altijd' werkt? En hoe optimaliseer je dezelfde website voor de allernieuwste apparaten?</p>"},{"__typename":"TextSectionRecord","title":"De oplossing: progressive enhancement","body":"<p>Bij De Voorhoede werken we graag <em>agile</em>. Ook tijdens dit project werkten we met scrum. Ons scrum-team bestond uit designers van <a href=\"https://hike.one/\" target=\"_blank\" rel=\"noopener\">Hike One</a> en back-end developers van 2dehands.be. Doordat we met verschillende disciplines in &eacute;&eacute;n ruimte zaten, konden we nauw samenwerken en snel knopen doorhakken.</p>\n<p>De grootste uitdaging was om de nieuwe website op een breed spectrum aan apparaten te laten werken. En om het op al deze apparaten snel te laten werken. We hebben dit gedaan door gebruik te maken van <em>progressive enhancement</em>.</p>\n<p>Progressive enhancement is geen technologie, maar een werkwijze waarbij je een basisvariant van de website beschikbaar maakt voor minder goed uitgeruste apparaten. De basisvariant biedt alle functionaliteit, maar is visueel uitgekleed en iets minder gebruiksvriendelijk. Zo kunnen gebruikers op (veelal) oudere apparaten de website toch goed gebruiken. Vervolgens wordt de gebruiksvriendelijkheid van de basisvariant stap voor stap verrijkt voor apparaten die uitgerust zijn met meer mogelijkheden.</p>\n<p>Tijdens het project is ons werk gereviewed door de <a href=\"http://www.filamentgroup.com/\" target=\"_blank\" rel=\"noopener\">Filament Group</a> uit Boston, deskundigen op het gebied van progressive enhancement. Hun conclusie:</p>"}],"metaData":{"expertisesTitle":"Expertises","expertises":[{"title":"Development"}],"deliverableTitle":"Deliverables","deliverables":[{"title":"Website"}],"technologiesTitle":"Platforms","technologies":[{"title":"HTML"},{"title":"CSS"},{"title":"JS"}],"interestedTitle":"Bekijk resultaat","interestedLinkUrl":".https://www.2dehands.be","interestedLinkLabel":"www.2dehands.be"},"quote":"Great job! Best website we’ve analyzed so far.","author":"Filament Group, Boston","getInTouchTitle":"Neem contact op"},"pivots":[]}