{"page":{"title":"Tradus","slug":"tradus","i18nSlugs":[{"locale":"en","value":"tradus"},{"locale":"nl","value":"tradus"}],"social":{"title":"Tradus | De Voorhoede","description":"How we launched a classifieds site for heavy machinery from scratch in only 8 weeks.","image":{"url":"https://www.datocms-assets.com/6524/1538576394-schermafbeelding-2018-10-03-om-16-16-18.png"}},"keywords":"front-end, front end, development, developer, web,     Progressive web app, Agile, Scrum, API, PWA, service worker, push notifications, offline, performance     ","heroIllustration":{"url":"https://www.datocms-assets.com/6524/1542186338-tradus.svg","format":"svg","alt":"Tradus"},"caseTeaser":{"title":"From idea to launch in 8 weeks","image":{"url":"https://www.datocms-assets.com/6524/1538576394-schermafbeelding-2018-10-03-om-16-16-18.png","format":"png","alt":null,"width":1170,"height":454}},"content":[{"__typename":"TextSectionRecord","title":"The challenge","body":"<p>We hadn&rsquo;t heard of a marketplace for heavy machinery before, but for the <a href=\"http://www.joinolx.com/this-is-olx-group\" target=\"_blank\" rel=\"noopener\">OLX Group</a> it was a logical next step in the process. Recently, they launched the app LetGo in the Netherlands, with which you can buy and sell locally. Internationally, they had already launched many successful classified ad platforms, such as Stradia for selling cars.</p>\n<p>Now, it was time to create a top notch platform for the heavy machinery market. During the first talks with OLX, two things were set in stone: the date of the launch of the Minimum Viable Product (MVP) and its name: Tradus. There were no sketches, no data, and no team. Time to get to work!</p>"},{"__typename":"TextSectionRecord","title":"The solution: a team of specialists","body":"<p>We quickly realised that front-end alone wouldn&rsquo;t be enough to create Tradus. We had to go look for other specialists: back-end developers from <a href=\"http://www.luciuswebsystems.nl/\" target=\"_blank\" rel=\"noopener\">Lucius</a> joined our team and from <a href=\"https://hike.one/\" target=\"_blank\" rel=\"noopener\">Hike One</a> came an interaction designer, a visual designer, and a copywriter.</p>\n<p>As contractor we brought in front-end specialists, a project manager and scrum master, and the office space and facilities. With De Voorhoede as link between all chains, the OLX Group did not experience a different environment.</p>"},{"__typename":"StorytellingBlockRecord","storyItem":{"title":"Our approach","items":[{"title":"Step 1: Scope session","body":"<p><span>During the scope session, we discovered the most important means to convince our target group of Tradus&rsquo; quality: a good search and filter functionality and a way to connect buyers and sellers of heavy equipment. This would become the focal point for the MVP. We made first sketches and used them as input for the functional development of Tradus.</span></p>","image":null},{"title":"Step 2: Tech prep","body":"<p><span>We developed the API, so that OLX&rsquo;s data partner&nbsp;</span><a href=\"http://www.hexon.cx/\" target=\"_blank\" rel=\"noopener\">Hexon</a><span>&nbsp;could deliver us ads for heavy machinery. Based on the sketches, we developed the first functional pages. By starting development early, we were able to tackle any technical obstacles early in the process.</span></p>","image":null},{"title":"Step 3: Five-week-sprint","body":"<p><span>There were five weeks left until launch, when we decided to use the scrum method. We decided when each page had to be finished and scheduled a demo for each week. During the sprints, the pages and functionalities really took shape, thanks to working closely together with the Product Owner. Designers and developers both work in the browser and take shortcuts when possible.</span></p>","image":null},{"title":"Step 4: Launch and celebrate!","body":"<p>After working hard for five weeks we&rsquo;re there: Tradus is live! To celebrate, we went out for dinner with the entire team and toasted to a successful cooperation. We couldn&rsquo;t be more proud of the end result and thoroughly enjoyed the first phase of creating a heavy machinery marketplace.</p>","image":null}]}},{"__typename":"ImageWithTextRecord","imageWithDescription":{"image":{"url":"https://www.datocms-assets.com/6524/1538577010-tradus-add-to-homescreen.jpg","alt":null,"width":926,"height":600,"format":"jpg"},"description":"Tradus is installable and available offline on smartphones","inverse":false}},{"__typename":"TextSectionRecord","title":"What’s next?","body":"<p>After the first launch, we did not decide to sit on our hands. As of now, it&rsquo;s also possible to save your favourite ads and as a seller, you can create your own info page. We continue to develop Tradus with the same team of specialists, strengthened by extra back-end developers and our own DevOps engineer. A few people from the OLX Group have joined us at our offices and work in a separate room. This enables us to quickly catch up with them.</p>"}],"metaData":{"expertisesTitle":"Expertises","expertises":[{"title":"Development"},{"title":"Prototyping"},{"title":"SEO"}],"deliverableTitle":"Deliverables","deliverables":[{"title":"Progressive web app"}],"technologiesTitle":"Technologies","technologies":[{"title":"Drupal"},{"title":"Microdata"},{"title":"Twig"}],"interestedTitle":"See result","interestedLinkUrl":"https://www.tradus.com","interestedLinkLabel":"www.tradus.com"},"quote":"","author":"","getInTouchTitle":"Get in touch"},"pivots":[]}