{"page":{"title":"Pick Up 10","slug":"pick-up-10","i18nSlugs":[{"locale":"en","value":"pick-up-10"},{"locale":"nl","value":"pick-up-10"}],"social":{"title":"Pick Up 10 | De Voorhoede","description":"In de voortzetting van zijn strijd tegen een plasticvrije oceaan gaat de Plastic Soup Surfer deze zomer op avontuur met zijn 3D geprinte foil SUP board, gemaakt van gerecycled plastic. En jij kunt bijdragen! ","image":null},"keywords":"plastic soep, plastic, zwerfafval, plastic soup surfer, sup board, google vision, fotoherkenning, google, api, netlify, cloudinary, klimaatverandering","heroIllustration":{"url":"https://www.datocms-assets.com/6524/1538570990-pick-up-10.svg","format":"svg","alt":"Pick up ten"},"caseTeaser":{"title":"Spread awareness of plastic littering","image":{"url":"https://www.datocms-assets.com/2850/1526629302-plastic-soup-surfer.jpeg","format":"jpeg","alt":null,"width":660,"height":320}},"content":[{"__typename":"TextSectionRecord","title":"De uitdaging: mensen bewust maken van plastic zwerfvuil","body":"<p>Plastic zwerfafval verandert in plastic soep en bedreigt onze oceanen. Het goede nieuws: in de voortzetting van zijn strijd tegen een plasticvrije oceaan gaat de <a href=\"https://www.plasticsoupsurfer.org/\">Plastic Soup Surfer</a> deze zomer op avontuur met zijn 3D geprinte foil SUP board, gemaakt van gerecycled plastic. En jij kunt bijdragen! De Plastic Soup Surfer wil dat iedereen meedoet aan deze &ldquo;Pick Up 10&rdquo; campagne. Wat je doet: je raapt plastic afval op en maakt er een foto van. Je opgepakte plastic wordt verwerkt in de surfplank; dankzij je foto&rsquo;s verzamelen we merknamen en fabrikanten. Zo kunnen we de mensen die in de positie zijn om werkelijk iets te veranderen aan de kern van het probleem, confronteren. Maar hoe kunnen wij, louter front-end developers, helpen het verschil te maken?</p>\n<p>We worden meestal gevraagd om een betere gebruikerservaring te bouwen, of teams te helpen effici&euml;nter te werken. Maar in dit geval wordt onze doelgroep juist niet aangespoord om meer of sneller te consumeren. Wat kunnen wij doen?</p>\n<p></p>\n<figure class=\"content-figure\"><picture class=\"fixed-ratio\"><source media=\"(min-width: 570px)\" type=\"image/webp\" srcset=\"https://www.datocms-assets.com/2850/1526629302-plastic-soup-surfer.jpeg?ch=Width,DPR&amp;auto=compress&amp;auto=format&amp;w=990\" /><source media=\"(min-width: 320px)\" type=\"image/webp\" srcset=\"https://www.datocms-assets.com/2850/1526629302-plastic-soup-surfer.jpeg?ch=Width,DPR&amp;auto=compress&amp;auto=format&amp;w=570\" /><source media=\"(min-width: 570px)\" srcset=\"https://www.datocms-assets.com/2850/1526629302-plastic-soup-surfer.jpeg?ch=Width,DPR&amp;auto=compress&amp;w=990\" /><source media=\"(min-width: 320px)\" srcset=\"https://www.datocms-assets.com/2850/1526629302-plastic-soup-surfer.jpeg?ch=Width,DPR&amp;auto=compress&amp;w=570\" /></picture></figure>"},{"__typename":"TextSectionRecord","title":"De oplossing: gamified plastic afval opruimen","body":"<p>Bij De Voorhoede zijn we nogal technology minded. Dus begonnen we met een idee dat gedreven werd door technologie: kunnen we op een foto afval automatisch herkennen? Blijkt van wel! En dat niet alleen: we kunnen herkennen of het plastic is, of het een flesje is, of er een merknaam op staat en nog veel meer. Hoe? We gebruiken <a href=\"https://cloud.google.com/vision/\">Google&rsquo;s Vision API</a>, een cloud service die afbeeldingen analyseert dankzij machine learning. Na een snelle test waren we overtuigd dat ons idee klopte. Maar een technisch bewezen idee is nog verre van iets bruikbaars voor de Plastic Soup Surfer.</p>"},{"__typename":"ImageWithTextRecord","imageWithDescription":{"image":{"url":"https://www.datocms-assets.com/6524/1535460060-pick-up-10idea.jpg","alt":null,"width":1108,"height":797,"format":"jpg"},"description":"Het idee: met machine learning plastic afval herkennen","inverse":false}},{"__typename":"TextSectionRecord","title":"","body":"<p>De informatie die we terugkrijgen van Google Vision geeft ons allerlei mogelijkheden. In eerste instantie helpt het de Plastic Soup Surfer en partner <a href=\"https://www.litterati.org/\">Litterati</a> in het gevecht voor duurzaamheid. Maar als developers kunnen we de data ook gebruiken om punten toe te kennen aan wat er in de foto te zien is. Met andere woorden: we kunnen plastic afval verzamelen gamifyen! Om onze idee&euml;n snel om te zetten in een werkend prototype organiseerden we een hackathon met de <a href=\"https://hike.one/\">designers van Hike One</a> en Merijn Tinga, de Plastic Soup Surfer zelf.</p>"},{"__typename":"ImageWithTextRecord","imageWithDescription":{"image":{"url":"https://www.datocms-assets.com/6524/1535460065-1526629287-pick-up-10-idea-copy.png","alt":"Plastic soup - Merijn Tinga","width":575,"height":400,"format":"png"},"description":"De hackathon waarmee de Pick Up 10 campagne werd afgetrapt","inverse":true}},{"__typename":"TextSectionRecord","title":"","body":"<p>Het is indrukwekkend wat je met een groep creatievelingen kan bereiken in een dag. Na een ochtend hadden we met 4 teams een werkend concept ontwikkeld om je uit te dagen om mee te doen, waarmee je foto&rsquo;s kan nemen, de Google Vision API was ge&iuml;mplementeerd, we hadden een beloningssysteem gebouwd en uitgedacht hoe gebruikers hun vrienden kunnen uitnodigen om de app ook te gaan gebruiken. Aan het eind van de hackathon knoopten we alles aan elkaar en presto! We hadden een prototype van de app:</p>"},{"__typename":"ResponsiveVideoRecord","mute":false,"loop":false,"autoplay":false,"video":{"url":"https://vimeo.com/265601385","title":"A New Campaign - PickUp10","height":360,"width":640,"provider":"vimeo","providerUid":"265601385","thumbnailUrl":"https://i.vimeocdn.com/video/695812178_640.jpg"}},{"__typename":"TextSectionRecord","title":"","body":"<p>Van prototype naar eindproduct was een fluitje van een cent. Dankzij het prototype wisten we al wat de technische uitdagingen waren, en welke interactiepatronen we moesten bouwen. De focus kwam daardoor op het bouwen van een robuuste app. We hoefden ons geen zorgen te maken over de haalbaarheid, of dat de app wel prettig zou bedienen. We stelden een backlog op, bouwden een solide API-implementatie, verfijnden de user flow, strooiden wat verslavende elementjes rond en ziedaar: Pick Up 10 is af! We hopen dat onze inzet je inspireert om zoveel mogelijk plastic zwerfafval op te ruimen omwille van de oceaan, en je je vrienden en familie uitdaagt om jouw score te verbeteren.</p>"},{"__typename":"ImageRecord","image":{"url":"https://www.datocms-assets.com/2850/1526629297-pick-up-10-screenshots.png","alt":null,"width":2384,"height":1412,"format":"png"},"alt":"Pick Up 10 screenshots","fullWidth":false}],"metaData":{"expertisesTitle":"Expertise","expertises":[{"title":"Development"},{"title":"Prototyping"}],"deliverableTitle":"Deliverables","deliverables":[{"title":"Progressive web app"}],"technologiesTitle":"Platforms","technologies":[{"title":"Nuxt.js"},{"title":"Vue.js"},{"title":"Google Vision API"}],"interestedTitle":"Bekijk resultaat","interestedLinkUrl":"https://www.pickup10.org/","interestedLinkLabel":"www.pickup10.org"},"quote":"","author":"","getInTouchTitle":"Neem contact op"},"pivots":[]}