{"page":{"title":"Tradus","slug":"tradus","i18nSlugs":[{"locale":"en","value":"tradus"},{"locale":"nl","value":"tradus"}],"social":{"title":"Tradus | De Voorhoede","description":"Hoe we binnen 8 weken een marktplaats voor zware voertuigen lanceerden.","image":{"url":"https://www.datocms-assets.com/6524/1538576394-schermafbeelding-2018-10-03-om-16-16-18.png"}},"keywords":"front-end, front end, development, developer, web,     Progressive web app, marktplaats, Agile, Scrum, PWA, service worker, push notificaties, offline, performance     ","heroIllustration":{"url":"https://www.datocms-assets.com/6524/1542186338-tradus.svg","format":"svg","alt":"Tradus"},"caseTeaser":{"title":"Van idee naar live in 8 weken","image":{"url":"https://www.datocms-assets.com/6524/1538576394-schermafbeelding-2018-10-03-om-16-16-18.png","format":"png","alt":null,"width":1170,"height":454}},"content":[{"__typename":"TextSectionRecord","title":"De uitdaging","body":"<p>Een marktplaats voor zware voertuigen? Dat hoorden we nog niet eerder. Voor <a href=\"http://www.joinolx.com/this-is-olx-group\" target=\"_blank\" rel=\"noopener\">OLX Group</a> wel een voor de hand liggende nieuwe markt. In Nederland verwierf OLX onlangs bekendheid met LetGo, een app om in je buurt te kopen en te verkopen. Internationaal lanceerde het daarv&oacute;&oacute;r vele succesvolle marktplaatsen, zoals Stradia voor tweedehands auto&rsquo;s.</p>\n<p>Tijd voor een nieuw doel: de allerbeste wereldwijde marktplaats voor zware voertuigen neerzetten. Tijdens het eerste gesprek met OLX stonden twee dingen vast: de lanceerdatum van het Minimum Viable Product (MVP) en de naam: Tradus. Er waren geen schetsen, geen data, geen team. Kortom, alles lag nog open. Aan de slag!</p>"},{"__typename":"TextSectionRecord","title":"De oplossing: Een team van specialisten","body":"<p>Al snel wordt duidelijk dat we dit project niet alleen met front-end redden. Op zoek naar andere specialisten! En die vinden we: back-end specialisten van <a href=\"http://www.luciuswebsystems.nl/\" target=\"_blank\" rel=\"noopener\">Lucius</a> en een interaction designer, visual designer en copywriter van <a href=\"https://hike.one/\" target=\"_blank\" rel=\"noopener\">Hike One</a>. Als hoofdaannemer verzorgen wij &mdash; naast de front-enders &mdash; het projectmanagement, de ruimte en faciliteiten en ook de Scrum Master! Met De Voorhoede als schakel tussen alle partijen is het voor OLX niet anders dan werken met &eacute;&eacute;n partij.</p>"},{"__typename":"StorytellingBlockRecord","storyItem":{"title":"Onze aanpak","items":[{"title":"Stap 1: Scope sessie","body":"<p><span>Tijdens de scope-sessie ontdekken we de belangrijkste doelen om de doelgroep te overtuigen van de kwaliteit van Tradus: een goede zoek- en filterfunctionaliteit en een manier om kopers en verkopers met elkaar in contact te brengen. Dit wordt de focus voor het MVP. We maken eerste grove schetsen, als input voor de functionele ontwikkeling.</span></p>","image":null},{"title":"Stap 2: Technische voorbereiding","body":"<p>We ontwikkelen de API, zodat we via OLX&rsquo; datapartner<span>&nbsp;</span><a href=\"http://www.hexon.cx/\" target=\"_blank\" rel=\"noopener\">Hexon</a>advertenties van zware voertuigen kunnen ontvangen. Op basis van de schetsen ontwikkelen we de eerste werkende pagina&rsquo;s. Door tijdig te starten met development kunnen we in een vroeg stadium technische obstakels tegenkomen en ze tackelen.</p>","image":null},{"title":"Stap 3: Vijf weken sprinten","body":"<p>Nog vijf weken tot de launch, toch gaan we scrummen. We bepalen wanneer welke pagina af moet zijn en plannen iedere week een demo. Tijdens de sprints krijgen de pagina&rsquo;s en functionaliteiten pas echt vorm door nauw samen te werken met de Product Owner. Designers en developers werken samen in de browser en nemen shortcuts waar nodig.</p>","image":null},{"title":"Stap 4: Launch & celebrate!","body":"<p>Na vijf weken knallen is het zo ver: we zijn live! Om dat te vieren gaan we met het hele team uit eten en proosten we op een mooie samenwerking. Supertrots op het eindresultaat &eacute;n met een stapel Tradus-gadgets in handen hebben we de eerste fase mooi afgerond.</p>","image":null}]}},{"__typename":"ImageWithTextRecord","imageWithDescription":{"image":{"url":"https://www.datocms-assets.com/6524/1538577010-tradus-add-to-homescreen.jpg","alt":null,"width":926,"height":600,"format":"jpg"},"description":"Tradus is installeerbaar en offline beschikbaar op smartphones","inverse":false}},{"__typename":"TextSectionRecord","title":"En nu?","body":"<p>We zitten niet stil! Je kunt nu al advertenties opslaan als favoriet, of als verkoper zichtbaar zijn op een informatiepagina. We blijven doorontwikkelen met hetzelfde team, dat is uitgebreid met meer back-end developers en onze Dev Ops engineer. Ook is de businesskant van Tradus nog dichterbij: zij werken nu vanuit een eigen ruimte in ons kantoor. Daardoor kunnen we nog sneller schakelen en elkaar iedere dag tijdens de lunch bijpraten.</p>"}],"metaData":{"expertisesTitle":"Expertises","expertises":[{"title":"Development"},{"title":"Prototyping"},{"title":"SEO"}],"deliverableTitle":"Deliverables","deliverables":[{"title":"Progressive web app"}],"technologiesTitle":"Platforms","technologies":[{"title":"Drupal"},{"title":"Microdata"},{"title":"Twig"}],"interestedTitle":"Bekijk resultaat","interestedLinkUrl":"https://www.tradus.com","interestedLinkLabel":"www.tradus.com"},"quote":"","author":"","getInTouchTitle":"Neem contact op"},"pivots":[]}