{"page":{"title":"Trouw, Volkskrant and Parool","slug":"trouw","i18nSlugs":[{"locale":"en","value":"trouw"},{"locale":"nl","value":"trouw"}],"social":{"title":"Trouw, Volkskrant and Parool | De Voorhoede","description":"One app strategy for multiple brands","image":null},"keywords":"","heroIllustration":{"url":"https://www.datocms-assets.com/6524/1542197587-de-persgroep.svg","format":"svg","alt":"de persgroep"},"caseTeaser":{"title":"Trouw, Volkskrant and Parool","image":{"url":"https://www.datocms-assets.com/2850/1514918712-trouw-as-pwa-android-ios-app.jpg","format":"jpg","alt":"Trouw.nl as PWA in browser (left), as PWA published to Google Play Store (middle) and as PWA published to Apple's App Store (right).","width":1600,"height":857}},"content":[{"__typename":"TextSectionRecord","title":"The challenge: performance and app development workflow over multiple brands","body":"<p>De <a href=\"https://www.persgroep.nl/\" target=\"_blank\" rel=\"noopener\">Persgroep Nederland</a> is a publisher of some of the biggest newpapers in the Netherlands. For their brands Volkskrant, Parool and Trouw there is one team responsible for all development and maintainance of these web sites and native apps. The team wanted to establish one workflow to develop all three brands. With this workflow they wanted to ensure web performance and share this development strategy across multiple brands. To establish this workflow, De Voorhoede was asked to help.</p>"},{"__typename":"TextSectionRecord","title":"The solution: put your money where your users are","body":"<p>One of the first things we do when starting a new assignment is consult the analytics to see how users are distributed over browsers and platforms. Analytics showed us that there was hardly any use for the native app. Since the large majority visit the website. we decided to use this to our advantage, and focus on web technology.</p>\n<p>By building an app-like experience in the browser and reusing that code to build a hybrid mobile app, we cut costs <em>and</em> ensured Apple App Store &amp; Google Play Store presence.</p>\n<p>This lead to the following strategy:</p>"},{"__typename":"TextSectionRecord","title":"Step 1: Lightning fast website","body":"<p>Since we reuse most of the web functionalities, a performant website leads to a performant <a href=\"https://developers.google.com/web/progressive-web-apps/\" target=\"_blank\" rel=\"noopener\">progressive web app (PWA)</a> and hybrid app. Besides that, <a href=\"https://wpostats.com/\" target=\"_blank\" rel=\"noopener\">research has shown</a> that performance has a massive impact on conversion, user engagement and more. We helped the team to develop a performance workflow resulting in the fastest news websites in the Netherlands. Next to that we established a performance budget to ensure performance during future development.</p>"},{"__typename":"ImageWithTextRecord","imageWithDescription":{"image":{"url":"https://www.datocms-assets.com/2651/1501078204-trouw-filmstrip.jpg","alt":null,"width":2492,"height":1227,"format":"jpg"},"description":"WebPageTest result showing Trouw.nl rendering in 0.6s compared to other news sites","inverse":false}},{"__typename":"TextSectionRecord","title":"Step 2: Modern web app for the masses","body":"<p>To create an app-like experience on the web we developed a PWA. It can, for example, send push notifications and deliver a connectivity independent experience due to a service worker. All of these functionalities work in modern browsers and the website is installable as PWA on mobile phones.</p>"},{"__typename":"ImageWithTextRecord","imageWithDescription":{"image":{"url":"https://www.datocms-assets.com/2651/1501078207-trouw-web-pwa-app.jpg","alt":null,"width":2203,"height":1280,"format":"jpg"},"description":"On the left side you see the website with PWA install banner, in the middle the fullscreen running PWA, on the right the hybrid Android app","inverse":true}},{"__typename":"TextSectionRecord","title":"Step 3: A bit of native for the rest","body":"<p>In order to have Apple App Store &amp; Google Play Store presence we wrapped the PWA in a React Native hybrid app. Our PWA strategy is future proof. At this point in time we can even reuse the PWA functionalitites on Android in the hybrid app. Despite the fact that iOS does not support PWA, by wrapping the website in a 'native app', we can still add the same functionalities with a React Native solution.</p>"}],"metaData":{"expertisesTitle":"Expertises","expertises":[{"title":"Development"},{"title":"Performance review"}],"deliverableTitle":"Deliverable","deliverables":[{"title":"Progressive web app"},{"title":"Hybrid web app"}],"technologiesTitle":"Technologies","technologies":[{"title":"Cordova"},{"title":"React Native"}],"interestedTitle":"See result","interestedLinkUrl":"https://www.trouw.nl/","interestedLinkLabel":"www.trouw.nl"},"quote":"","author":"","getInTouchTitle":"Get in touch"},"pivots":[]}