{"page":{"title":"RTL Weekend Magazine","slug":"rtl-weekend-magazine","i18nSlugs":[{"locale":"en","value":"rtl-weekend-magazine"},{"locale":"nl","value":"rtl-weekend-magazine"}],"social":{"title":"RTL Weekend Magazine | De Voorhoede","description":"By using clever techniques we have brought the success of the RTL Weekend Magazine tablet app to the web.","image":null},"keywords":"","heroIllustration":{"url":"https://www.datocms-assets.com/6524/1539870467-rtl-weekend-magazine.svg","format":"svg","alt":"rtl magazine"},"caseTeaser":{"title":"From app to web","image":{"url":"https://www.datocms-assets.com/6524/1539870701-rtl-weekend-magazine.png","format":"png","alt":null,"width":1988,"height":1241}},"content":[{"__typename":"TextSectionRecord","title":"The challenge: bringing the app's success to the web","body":"<p>The RTL Weekend Magazine App is a popular tablet app. RTL Nieuws asked De Voorhoede to translate this success to the web. making it available for a larger audience.</p>\n<p>The tablet app's success is due to the enjoyable user experience and fancy appearance. With the translation to the web we want to keep that same experience. This way we can ensure the same quality and give visitors a familiar feel.</p>\n<p>Visitors of the new site use a wide variety of devices. The content should always be available and displayed properly on all these devices. Users can be on the road and hence have a slow, expensive or instable internet connection. In these cases, being able to show content with as little resources as possible is crucial.</p>"},{"__typename":"TextSectionRecord","title":"The solution: a responsive website","body":"<p>With the right combination of colors, icons and images we brought the familiar feeling of the app to the web. We have created a site that works on a wide collection of devices with a clever use of media queries and other functionalities of (mobile) browsers.</p>"},{"__typename":"ImageRecord","image":{"url":"https://www.datocms-assets.com/6524/1539870976-rtl-weekend-magazine-devices.jpg","alt":null,"width":3862,"height":1523,"format":"jpg"},"alt":"RTL Weekend Magazine","fullWidth":false},{"__typename":"TextSectionRecord","title":"","body":"<p>Because of new techniques in modern browsers and mobile devices, we are less dependent on extra libraries or plugins. As a result, we are able to keep the size of a website to a minimum. This way we make sure the site is readily available, even on slow connections.</p>\n<p>Images are often the largest bottleneck. To provide the best quality, even a large screen sizes, we have to load heavy files. We were able to ensure an optimal ratio between quality and loading time, by using techniques such as <code>scrset</code> and lazy loading the images (at the moment they almost appear in the viewport).</p>"}],"metaData":{"expertisesTitle":"Expertises","expertises":[{"title":"Development"}],"deliverableTitle":"Deliverables","deliverables":[{"title":"Web app"}],"technologiesTitle":"Technologies","technologies":[{"title":"Gulp"},{"title":"Nunjucks"}],"interestedTitle":"","interestedLinkUrl":"","interestedLinkLabel":""},"quote":"","author":"","getInTouchTitle":"Get in touch"},"pivots":[]}