{"page":{"title":"Trouw, Volkskrant en Parool","slug":"trouw","i18nSlugs":[{"locale":"en","value":"trouw"},{"locale":"nl","value":"trouw"}],"social":{"title":"Trouw, Volkskrant en Parool | De Voorhoede","description":"Eén app strategie voor meerdere merken","image":null},"keywords":"","heroIllustration":{"url":"https://www.datocms-assets.com/6524/1542197587-de-persgroep.svg","format":"svg","alt":"de persgroep"},"caseTeaser":{"title":"Trouw, Volkskrant en Parool","image":{"url":"https://www.datocms-assets.com/2850/1514918712-trouw-as-pwa-android-ios-app.jpg","format":"jpg","alt":"Trouw.nl as PWA in browser (left), as PWA published to Google Play Store (middle) and as PWA published to Apple's App Store (right).","width":1600,"height":857}},"content":[{"__typename":"TextSectionRecord","title":"De uitdaging: performance en app development strategie voor meerdere merken","body":"<p>De<span>&nbsp;</span><a href=\"https://www.persgroep.nl/\" target=\"_blank\" rel=\"noopener\">Persgroep Nederland</a><span>&nbsp;</span>is de uitgever van meerdere grote nieuwsmerken in Nederland en Belgi&euml;. Voor Volkskrant, Parool and Trouw is er &eacute;&eacute;n team verantwoordelijk voor ontwikkeling en onderhoud van de websites en apps. Dit team wilde &eacute;&eacute;n werkwijze neerzetten om de websites en apps van deze 3 merken te herontwikkelen en te onderhouden. Deze werkwijze moest ten eerste web performance garanderen. Ten tweede moest deze werkwijze leiden tot een onderhoudsvriendelijke en herbruikbare app strategie. De Persgroep vroeg de Voorhoede te helpen bij het ontwikkelen van deze strategie.</p>"},{"__typename":"TextSectionRecord","title":"De oplossing: investeer in je gebruikers","body":"<p>Als we starten met een nieuwe opdracht kijken we vaak naar de analytics om te zien hoe gebruikers verdeeld zijn over browsers en platformen. Hieruit bleek dat de native apps een stuk minder gebuikt werden dan de website. We hebben dit in ons voordeel gebruikt, door te focussen op web technologie.</p>\n<p>De ontwikkelkosten worden enorm gedrukt wanneer je een appy ervaring cre&euml;ert in de browser en deze hergebruikt in een hybride app. Bovendien maak je een merk vindbaar in de Apple App Store &amp; Google Play Store.</p>\n<p>Dit leidde tot de volgende strategie:</p>"},{"__typename":"TextSectionRecord","title":"Stap 1: Supersnelle website","body":"<p>Omdat we zo veel mogelijk functionaliteit van de website hergebruiken in de hybride app, leidt een snelle website tot een snelle <a href=\"https://developers.google.com/web/progressive-web-apps/\" target=\"_blank\" rel=\"noopener\">progressive web app (PWA)</a> en snelle hybride app. Bovendien heeft <a href=\"https://wpostats.com/\" target=\"_blank\" rel=\"noopener\">onderzoek aangetoond</a> dat web performance een enorme impact heeft op conversie en behoud van je gebruikers. We hebben het team geholpen een performance workflow neer te zetten, wat heeft geresulteerd in de snelste nieuwswebsite van Nederland. Daarnaast hebben we een performance budget opgesteld zodat performance centraal blijft staan tijdens ontwikkeling in de toekomst.</p>"},{"__typename":"ImageWithTextRecord","imageWithDescription":{"image":{"url":"https://www.datocms-assets.com/2651/1501078204-trouw-filmstrip.jpg","alt":null,"width":2492,"height":1227,"format":"jpg"},"description":"WebPageTest resultaat waar Trouw.nl in 0.6s laadt tegenover een aantal andere online niewssites","inverse":false}},{"__typename":"TextSectionRecord","title":"Stap 2: Moderne web app voor de massa","body":"<p>Om een 'appy' ervaring te bewerkstelligen op het web hebben we een PWA ontwikkeld. Deze kan bijvoorbeeld push notificaties versturen en dezelfde snelheidservaring geven onafhankelijk van de connectiviteit van de gebruiker. Al deze functionaliteiten werken in moderne browsers en de website is installeerbaar als PWA.</p>"},{"__typename":"ImageWithTextRecord","imageWithDescription":{"image":{"url":"https://www.datocms-assets.com/2651/1501078207-trouw-web-pwa-app.jpg","alt":null,"width":2203,"height":1280,"format":"jpg"},"description":"Aan de linkerkant is de website met PWA install banner te zien, in het midden de fullscreen PWA en aan de rechterkant de hybride Android app","inverse":true}},{"__typename":"TextSectionRecord","title":"Stap 3: Een beetje native voor de rest","body":"<p>Om vindbaar te zijn in de Apple App Store &amp; Google Play Store hebben we de PWA in een React Native hybrid app gestopt. De PWA strategie is gericht op de toekomst. Op dit moment kunnen we zelfs de PWA functionaliteiten hergebruiken in de Android hybride app. En ondanks dat dit op iOS niet kan, kunnen we wel deze functionaliteiten nabouwen met een React Native oplossing.</p>"}],"metaData":{"expertisesTitle":"Expertises","expertises":[{"title":"Development"},{"title":"Performance review"}],"deliverableTitle":"Deliverable","deliverables":[{"title":"Progressive web app"},{"title":"Hybrid web app"}],"technologiesTitle":"Platforms","technologies":[{"title":"Cordova"},{"title":"React Native"}],"interestedTitle":"Bekijk resultaat","interestedLinkUrl":"https://www.trouw.nl/","interestedLinkLabel":"www.trouw.nl "},"quote":"","author":"","getInTouchTitle":"Neem contact op"},"pivots":[]}