{"page":{"title":"NPO Dashboard","slug":"npo-dashboard","i18nSlugs":[{"locale":"en","value":"npo-dashboard"},{"locale":"nl","value":"npo-dashboard"}],"social":{"title":"NPO Dashboard | De Voorhoede","description":"Een big data dashboard voor de redacties van NPO en NOS ontwikkeld volgens de Kanban methode","image":null},"keywords":"npo, big data, analytics, statistiek, d3, d3.js, riot, riotjs, kanban, iteratief, analyse, dashboard, diagram, grafiek, nos","heroIllustration":{"url":"https://www.datocms-assets.com/6524/1539866631-npo-dashboard.svg","format":"svg","alt":"npo dashboard"},"caseTeaser":{"title":"Helder inzicht in realtime bezoekersstatistieken","image":{"url":"https://www.datocms-assets.com/6524/1539866786-npo-topspin-scrum.jpg","format":"jpg","alt":null,"width":1440,"height":812}},"content":[{"__typename":"TextSectionRecord","title":"","body":"<p>Binnen het Nederlandse publieke omroepbestel (NPO) werd in 2015 een project gestart om op basis van &lsquo;big data&rsquo; een aantal pilots te doen. Een van die pilots was het ontwikkelen van een dashboard voor redacties om direct <strong>inzicht te krijgen in bezoekers/kijkersstatistieken en trends</strong>. <a href=\"http://cleverlions.com/\" target=\"_blank\" rel=\"noopener\">CleverLions</a> vroeg als aannemer van dit project De Voorhoede om dit configureerbare dashboard te ontwikkelen.</p>"},{"__typename":"TextSectionRecord","title":"De uitdaging: bouw een prototype op basis van complexe data","body":"<p>De NPO is een complexe mediaorganisatie. Er wordt niet alleen televisie gemaakt, maar hier leeft ook de NOS als nieuwsorganisatie, en het internetforum van bijvoorbeeld Kassa, dat grote bezoekersaantallen trekt. Elk van deze redacties gebruikt eigen software. Soms heeft die software een moderne API, soms helemaal niet. <strong>Dataontsluiting is dus een grote uitdaging</strong>.</p>\n<p>NPO wil voor elke redactie een dashboard willen kunnen aanbieden dat dezelfde soort informatie weergeeft (bezoekersaantal, shares op sociale netwerken, snelste stijgers, enzovoorts) hebben we een API nodig die alle verschillen normaliseert. Tekst die bij de een <code>header</code> wordt genoemd en bij de ander <code>caption</code> wordt in onze API allemaal gevangen als <code>title</code>. Bovendien moet deze data zo <em>realtime</em> mogelijk zijn. Alleen als een trend zich letterlijk voor hun ogen ontwikkelt, kan een redactie werkelijk ingrijpen of aanhaken.</p>"},{"__typename":"ImageWithTextRecord","imageWithDescription":{"image":{"url":"https://www.datocms-assets.com/6524/1539867055-npo-topspin-graph.jpg","alt":null,"width":1024,"height":420,"format":"jpg"},"description":"Deze grafiek geeft het verloop van bezoekersaantallen weer. De oranje lijn is het werkelijke aantal, de zwarte het verwachte aantal en het grijze vlak de bandbreedte van die verwachting.","inverse":false}},{"__typename":"TextSectionRecord","title":"","body":"<p>Om die data inzichtelijk te maken, zoeken we een <strong>balans tussen de scanbaarheid en de hoeveelheid informatie</strong> die we tegelijk op het dashboard weergeven. Met herkenbare icons, foto&rsquo;s, grafieken en taartdiagrammen bijvoorbeeld.</p>\n<p>Tot slot ging het om een prototype: we wilden vooral veel leren, en idee&euml;n snel kunnen uitwerken en bediscussi&euml;ren.</p>\n<p>Samen met de big data-experts van <a href=\"https://www.godatadriven.com/\" target=\"_blank\" rel=\"noopener\">GoDataDriven</a> en designers van <a href=\"https://hike.one/\" target=\"_blank\" rel=\"noopener\">Hike One</a> gingen we aan de slag.</p>"},{"__typename":"TextSectionRecord","title":"De oplossing: werk iteratief en vraaggestuurd","body":"<p>Het was belangrijk dat het dashboard <em>actionable</em> werd voor redacties. Aan de andere kant hadden we een berg data die uitnodigde om mee te experimenteren. Door vragen te blijven stellen, veel demo&rsquo;s te geven en flexibele code te schrijven bleven we gefocust.</p>"},{"__typename":"ImageWithTextRecord","imageWithDescription":{"image":{"url":"https://www.datocms-assets.com/6524/1539866786-npo-topspin-scrum.jpg","alt":null,"width":1440,"height":812,"format":"jpg"},"description":"In dit project werkten we volgens de Agile Kanban-methode","inverse":true}},{"__typename":"TextSectionRecord","title":"API op maat voor de front-end","body":"<p>De meeste grote uitdagingen zaten aan de kant van de back-end: het ontsluiten van data, normaliseren, analyseren en aanbieden in een API aan de front-end. Maar wat moet er in die API? Dat wordt eigenlijk bepaald door wat er op het dashboard getoond moet worden. Omdat die ontsluiting complex is, is het verstandig om selectief te werk te gaan. Zo bespraken we voortdurend met de back-end developers wat voor informatie in welk format we nodig hadden om een onderdeel in het dashboard te laten zien. Dat maakt de front-end ook nog eens <strong>sneller, omdat de API perfect op maat is gesneden</strong>.</p>"},{"__typename":"TextSectionRecord","title":"Microframework voor snelle iteratie","body":"<p>Om snel te kunnen ontwikkelen is het slim om iets van de plank te trekken, maar niet zo groot uit te pakken dat het je development-tempo omlaagbrengt. We kozen voor <a href=\"http://riotjs.com/\" target=\"_blank\" rel=\"noopener\">Riot</a>: gericht op modulair development en erg flexibel. We zorgden dat elk onderdeel op de pagina zichzelf kan updaten met nieuwe informatie. De titels, layout en posities van grafieken en lijstjes op de pagina zijn aanpasbaar in een eenvoudig configuratiebestand. Tot slot ontwikkelden we een &lsquo;TV modus&rsquo;-variant van het dashboard, met een donkere achtergrond zeer geschikt voor grote schermen die centraal op een redactie hangen.</p>\n<p>Door deze aanpak konden we op laagdrempelige wijze <strong>experimenteren met de getoonde informatie</strong>.</p>"},{"__typename":"TextSectionRecord","title":"Visueler is beter","body":"<p>Mensen zijn erg visueel ingesteld. Om te laten zien dat een artikel het beter doet dan een ander, zetten we ze op volgorde in een lijstje. Als er meer op Facebook wordt gepraat dan op Twitter, is dat meteen zichtbaar met een taartdiagram.</p>"},{"__typename":"ImageWithTextRecord","imageWithDescription":{"image":{"url":"https://www.datocms-assets.com/6524/1539867216-npo-topspin-dashboard.jpg","alt":null,"width":1024,"height":420,"format":"jpg"},"description":"Links het dashboard met bezoekersaantallen en de populariteit van twee ‘top stories’; rechts een detailpagina met informatie over social media.","inverse":false}},{"__typename":"TextSectionRecord","title":"","body":"<p>In een vroege iteratie maakten we vooral gebruik van tekst en percentages in rood of groen. Naarmate het project vorderde, besloten we over te stappen op sterkere visualisaties. Met D3.js konden we <strong>snel grafieken, diagrammen en &lsquo;sparklines&rsquo; tonen</strong>. Nu werd in een oogopslag veel meer duidelijk.</p>\n<p>In juli 2016 werd het project TopSpin afgesloten met een grote presentatie en de geboorte van een nieuwe afdeling die zich gaat richten op big data en datavisualisatie. We zijn trots dat we hieraan hebben kunnen bijdragen.</p>"}],"metaData":{"expertisesTitle":"Expertises","expertises":[{"title":"Development"},{"title":"Prototyping"}],"deliverableTitle":"Deliverables","deliverables":[{"title":"Dashboard"}],"technologiesTitle":"Platforms","technologies":[{"title":"RiotJS"},{"title":"D3.js"}],"interestedTitle":"","interestedLinkUrl":"","interestedLinkLabel":""},"quote":"","author":"","getInTouchTitle":"Neem contact op"},"pivots":[]}