{"page":{"title":"Commtrac","slug":"commtrac","i18nSlugs":[{"locale":"en","value":"commtrac"},{"locale":"nl","value":"commtrac"}],"social":{"title":"Commtrac | De Voorhoede","description":"Onze oplossing voor het aansturen van scheepsterminals in de browser: visueel, realtime, en modulair","image":null},"keywords":"scheepsterminal, haven, havengebied, software, DBIS, commtrac, interface, realtime, modulair, angular, angularjs","heroIllustration":{"url":"https://www.datocms-assets.com/6524/1539938877-commtrac.svg","format":"svg","alt":"commtrac"},"caseTeaser":{"title":"Beheer scheepsterminals wereldwijd vanuit de browser","image":{"url":"https://www.datocms-assets.com/6524/1539939018-commtrac-ship.jpg","format":"jpg","alt":null,"width":1200,"height":515}},"content":[{"__typename":"TextSectionRecord","title":"","body":"<p>Commtrac is een software pakket van DBIS waarmee scheepsterminals worden aangestuurd. Om specifiek te zijn: terminals die bulk en stukgoederen verwerken. Denk aan kool, graan, ijzererts, auto&rsquo;s, balen papier, enzovoorts.</p>"},{"__typename":"TextSectionRecord","title":"De uitdaging: van Windows desktop naar web","body":"<p>Met Commtrac wordt de planning van de schepen geregeld, het laden en lossen en de opslag van goederen op terminals. Daarnaast is er een dashboard waarop verschillende statistieken te zien zijn.</p>\n<p>De bestaande applicatie was verouderd en alleen voor Windows beschikbaar. De applicatie was tot dan toe organisch gegroeid en bestond uit grote gegevenstabellen waarop invoerformulieren waren gebouwd. Dit bemoeilijkte het onderhoud en ontwikkeling van nieuwe features. De user interface leed er ook onder: de leercurve voor nieuwe werknemers en het gebruiksgemak was niet altijd optimaal.</p>\n<p>DBIS wilde de applicatie vernieuwen. Onze opdracht werd om een versimpelde applicatiestructuur neer te zetten. Zo wordt de unieke workflow per medewerker beter ondersteund met <strong>heldere overzichten en intu&iuml;tieve invoerformulieren</strong>.</p>"},{"__typename":"ImageWithTextRecord","imageWithDescription":{"image":{"url":"https://www.datocms-assets.com/6524/1539939224-commtrac-cargo.jpg","alt":null,"width":1024,"height":449,"format":"jpg"},"description":"Zo heeft een kraanmachinist die de goederen daadwerkelijk in het ruim van het schip plaatst een tastbaar overzicht.","inverse":false}},{"__typename":"TextSectionRecord","title":"De oplossing: visueel en modulair met een webapplicatie","body":"<p>Door de Windows-desktopomgeving los te laten en ons te richten op een webapplicatie voldoen we meteen aan een aantal eisen:</p>\n<ul>\n<li>Alle data wordt centraal opgeslagen</li>\n<li>Medewerkers hoeven niets op hun werkstation te installeren, en hebben <strong>altijd de meest recente versie</strong></li>\n<li>De applicatie kan worden gebruikt op allerlei verschillende apparaten, ook mobiel</li>\n</ul>"},{"__typename":"StorytellingBlockRecord","storyItem":{"title":"De belangrijkste ontwikkelingen aan het nieuwe Commtrac:","items":[{"title":"Sterk visueel georiënteerde interface","body":"<p><span>De interface is op de schop gegaan en alle schermen zijn opnieuw ontworpen. Het laden en lossen van het schip is bijvoorbeeld grafisch gevisualiseerd. Hierdoor heeft een operator bij het lossen goed overzicht in welke goederen zich waar in het schip bevinden. Bij het laden kan de operator goederen direct vanaf een lijst in het ruim van het schip slepen.</span></p>","image":null},{"title":"Complexe relaties eenvoudig beheerd","body":"<p><span>Als basis voor de webapplicatie kozen we AngularJS. In de applicatie bestaan veel formulieren die zeer uitgebreid en gecompliceerd kunnen zijn. Als voorbeeld: er zijn diverse beperkende verbanden die tussen verschillende invoervelden bestaan. Dat wil zeggen: wanneer je iets in het ene invoerveld hebt ingevoerd kan dit invloed hebben op de opties die je mag invoeren in een ander veld. Met AngularJS kunnen deze&nbsp;</span><strong>snel complex wordende verbanden goed worden beheerd</strong><span>.</span></p>","image":null},{"title":"Schaalbaarheid en customization","body":"<p>De applicatie is geheel uit componenten opgebouwd. Een component is een klein onderdeel met eigen logica en layout, dat onafhankelijk van andere componenten in een scherm kan worden geplaatst. Samen vormen ze zo een nieuw component of een scherm dat eerder niet bestond.</p>\n<p>Dit betekent dat DBIS gemakkelijk zelf nieuwe formulieren en schermen kan maken. Zo kan Commtrac worden<span>&nbsp;</span><strong>aangepast aan de wensen en behoeften van elke terminal</strong>.</p>","image":null}]}},{"__typename":"ImageWithTextRecord","imageWithDescription":{"image":{"url":"https://www.datocms-assets.com/6524/1539939240-commtrac-dashboard.jpg","alt":null,"width":1046,"height":408,"format":"jpg"},"description":"Een ander voordeel is dat het eenvoudig mogelijk wordt om gegevens direct op te slaan en uit te lezen. Zo is de informatie in het scherm altijd ‘live’.","inverse":false}}],"metaData":{"expertisesTitle":"Expertises","expertises":[{"title":"Development"}],"deliverableTitle":"Deliverables","deliverables":[{"title":"Web app"}],"technologiesTitle":"Platforms","technologies":[{"title":"AngularJS"},{"title":"D3.js"}],"interestedTitle":"","interestedLinkUrl":"","interestedLinkLabel":""},"quote":"","author":"","getInTouchTitle":"Neem contact op"},"pivots":[]}