{"page":{"title":"Hike One","slug":"hike-one","i18nSlugs":[{"locale":"en","value":"hike-one"},{"locale":"nl","value":"hike-one"}],"social":{"title":"Hike One | De Voorhoede","description":"Niet lang geleden heeft het digital designer agency UNITiD zichzelf hernoemd naar Hike One. Met deze naamsverandering kwam ook een nieuwe identiteit. Een goed moment om hun oude, trage Wordpress website te vervangen door een snelle en flashy website, die ook nog eens leuk is om te gebruiken.","image":{"url":"https://www.datocms-assets.com/2850/1519986567-screenshot.png"}},"keywords":"Hike One, DatoCMS, NextJS, GSAP","heroIllustration":{"url":"https://www.datocms-assets.com/6524/1542198226-hike-one.svg","format":"svg","alt":"Hike One"},"caseTeaser":{"title":"Een betoverende website met stevige content","image":{"url":"https://www.datocms-assets.com/6524/1537963521-1512565972-2017-10-hike-one-design-24.jpg","format":"jpg","alt":null,"width":715,"height":477}},"content":[{"__typename":"TextSectionRecord","title":"De uitdaging: een betoverende website met stevige content","body":"<p>In 2017 veranderde UNITiD, interactiedesignbureau in Amsterdam van naam. Met die naamsverandering kwam ook een nieuwe identiteit. Een goed excuus om hun oude logge Wordpress-site te vervangen door eentje die snel, flitsend en gebruiksvriendelijk is. Inclusief een CMS met een intu&iuml;tieve interface zodat auteurs moeiteloos nieuwe pagina's kunnen aanmaken. Met originele layouts die tekst, grote responsive afbeeldingen en video's bevatten, moet elke pagina een eigen verhaal kunnen vertellen. Bovendien moeten ze goed te vinden zijn en doorzoekbaar door zoekmachines. Dat zijn een hoop voorwaarden, maar we zijn erin geslaagd om aan alles te voldoen. Het resultaat is te vinden op <a href=\"http://hike.one/\">hike.one</a> en dit is hoe we het hebben gedaan.</p>"},{"__typename":"TextSectionRecord","title":"De oplossing: een isomorphic website met een gebruiksvriendelijk CMS","body":"<p>Content is king, daarom is een goed CMS belangrijk. We vonden een uitstekende kandidaat in DatoCMS. Dat is een CMS dat aan te roepen is via een API, waardoor je niet gebonden bent aan een vooraf bepaald framework. Hierdoor kunnen wij de front-end stack kiezen die het beste past bij het project. Daarnaast is het component-gericht, waardoor het mogelijk is om pagina's samen te stellen met modulaire blokken. Copywriters kunnen unieke, boeiende verhalen vertellen door herbruikbare componenten te combineren voor nieuwe pagina's. En dat zonder de hulp van een developer. Het CMS is zelfs zo gebruiksvriendelijk dat je een gloednieuwe pagina binnen enkele minuten kan opmaken en online kan zetten.</p>"},{"__typename":"ResponsiveVideoRecord","mute":false,"loop":false,"autoplay":false,"video":{"url":"https://vimeo.com/258237744/2c8dc37a22","title":"Hike One - case page","height":360,"width":622,"provider":"vimeo","providerUid":"258237744","thumbnailUrl":"https://i.vimeocdn.com/video/686364056_295x166.jpg"}},{"__typename":"TextSectionRecord","title":"","body":"<p>Goed content management was de eerste stap, Next.js was de tweede. Next.js is een front-end framework gemaakt met React, waarmee het makkelijk is om delen van de content op de server, en delen in de browser te genereren. Dit wordt ook wel een &lsquo;isomorphic&rsquo; website genoemd. Het resultaat hiervan is dat de website geoptimaliseerd is voor SEO, snel en responsive aanvoelt en de gebruiker een single page app-gevoel ervaart.</p>\n<p>Tot slot is er de eye candy: een vette menu-animatie en heftige parallax effecten die op verschillende plekken zijn toegepast. GreenSock Animation Platform heeft ons hierbij geholpen: een JavaScript animatielibrary met hoge performance, &eacute;n makkelijk om te gebruiken.</p>"},{"__typename":"ResponsiveVideoRecord","mute":false,"loop":false,"autoplay":false,"video":{"url":"https://vimeo.com/256077608/41a39f3513","title":"Hike One - menu animation","height":356,"width":640,"provider":"vimeo","providerUid":"256077608","thumbnailUrl":"https://i.vimeocdn.com/video/683652105_640.jpg"}}],"metaData":{"expertisesTitle":"Expertises","expertises":[{"title":"Development"}],"deliverableTitle":"Deliverables","deliverables":[{"title":"Website"}],"technologiesTitle":"Platforms","technologies":[{"title":"GSAP"},{"title":"NextJS"},{"title":"React"}],"interestedTitle":"Bekijk resultaat","interestedLinkUrl":"https://hike.one","interestedLinkLabel":"www.hike.lne"},"quote":"","author":"","getInTouchTitle":"Neem contact op"},"pivots":[]}