{"page":{"title":"Swipe & Shop","slug":"swipe-and-shop","i18nSlugs":[{"locale":"en","value":"swipe-and-shop"},{"locale":"nl","value":"swipe-and-shop"}],"social":{"title":"Swipe & Shop | De Voorhoede","description":"Discover and shop new fashion with the hybrid app Swipe & Shop","image":null},"keywords":"swipe, shop, tinder, fashion, hybrid, app, iOS, Android","heroIllustration":{"url":"https://www.datocms-assets.com/6524/1542187394-swipe-and-shop.svg","format":"svg","alt":"swipe en shop"},"caseTeaser":{"title":"Discover and shop new fashion with the hybrid app Swipe & Shop","image":{"url":"https://www.datocms-assets.com/6524/1539876093-swipe-and-shop.png","format":"png","alt":null,"width":749,"height":566}},"content":[{"__typename":"TextSectionRecord","title":"The challenge: let 80,000 (and counting) women find their dream clothing","body":"<p>Apps like Tinder prove that rewarding users for completing small actions works very well. Swipe &amp; shop was designed with this in mind. Who wouldn&rsquo;t like to swipe around for a bit while waiting for the bus? Since the launch of Swipe &amp; Shop, over 80,000 women thought exactly that.</p>\n<p>Swipe &amp; Shop was created as a start-up within Sanoma Digital Lab in the Netherlands. The app helps people find new fashion. It presents you with products you can either <em>like</em> or <em>dislike</em>. What you like, will end up in your wishlist; all other products won&rsquo;t show up again. To buy a product, you can open the online retailer&rsquo;s web shop directly from within the app.</p>\n<p>The app targets young women of between 18 and 35 years old. They are digital natives: they know their way around the web, how to use (native) smartphone apps and demand a good user experience. Our challenge: build an app that meets and exceeds this target group&rsquo;s high expectations.</p>"},{"__typename":"TextSectionRecord","title":"The solution: a hybrid Cordova app","body":"<p>Swipe &amp; Shop is a hybrid app: built with <strong>web technology</strong> so that it runs on any platform. Since we only need to maintain <strong>one code base</strong>, development time and costs are low. It doesn&rsquo;t limit us however: the app has access to <strong>native device features</strong> that allow us to, for example, use push messages to communicate directly with the app&rsquo;s users.</p>"},{"__typename":"ImageRecord","image":{"url":"https://www.datocms-assets.com/6524/1539876224-swipe-shop-devices.jpg","alt":null,"width":1230,"height":640,"format":"jpg"},"alt":"Swipe & Shop","fullWidth":false},{"__typename":"TextSectionRecord","title":"","body":"<p>During the project we adopted the <strong>agile</strong> methodology and worked at our client&rsquo;s offices. This helped us to cooperate closely with Sanoma&rsquo;s designers and back-end developers. Because we were involved in the design process at an early stage, we could iterate in <strong>short release cycles</strong>, reducing overhead costs.</p>\n<p>By working in a <strong>lean</strong> way, we could base the entire process of design and development on user tests and user feedback. This would give us lots of information on nice-to-haves and missing features. The involvement of users in this way lead to an <strong>active user base</strong> and a very positive attitude within the team.</p>\n<p>During the course of development, Apple eased their rules on downloading code within an app. Instead of requiring users to install the latest updates from the App Store, we could let the app download and install updates itself. Users don&rsquo;t have to worry about bugs and missing out on new features anymore, since they&rsquo;re <strong>always up to date</strong>.</p>"}],"metaData":{"expertisesTitle":"Expertises","expertises":[{"title":"Development"}],"deliverableTitle":"Deliverables","deliverables":[{"title":"Hybrid web app"}],"technologiesTitle":"Technologies","technologies":[{"title":"AngularJS"},{"title":"Cordova"}],"interestedTitle":"","interestedLinkUrl":"","interestedLinkLabel":""},"quote":"","author":"","getInTouchTitle":"Get in touch"},"pivots":[]}