{"page":{"title":"Pick Up 10","slug":"pick-up-10","i18nSlugs":[{"locale":"en","value":"pick-up-10"},{"locale":"nl","value":"pick-up-10"}],"social":{"title":"Pick Up 10 | De Voorhoede","description":"Continuing his fight for a plastic-free ocean, this summer the Plastic Soup Surfer will go adventuring with his 3D-printed foil SUP board made of recycled plastic. And you can help!","image":null},"keywords":"Pick Up 10, hackathon, image recognition, plastic littering, plastic soup, plastic soup surfer, plastic, ocean, climate change","heroIllustration":{"url":"https://www.datocms-assets.com/6524/1538570990-pick-up-10.svg","format":"svg","alt":"Pick up ten"},"caseTeaser":{"title":"Spread awareness of plastic littering","image":{"url":"https://www.datocms-assets.com/2850/1526629302-plastic-soup-surfer.jpeg","format":"jpeg","alt":null,"width":660,"height":320}},"content":[{"__typename":"TextSectionRecord","title":"The challenge: spread awareness of plastic littering","body":"<p>Plastic litter turns into plastic soup and threatens our oceans. The good news: continuing his fight for a plastic-free ocean, this summer the <a href=\"https://www.plasticsoupsurfer.org/\">Plastic Soup Surfer</a> will go adventuring with his 3D-printed foil SUP board made of recycled plastic. And you can help! The Plastic Soup Surfer invites everyone to join in his &ldquo;Pick Up 10&rdquo; campaign. You pick up plastic litter and take a picture of it. The picked-up plastic goes into the surf board; the pictures identify brands and manufacturers. This way, we confront those who are in power which will hopefully make a change at the root of the problem. So how can we, as mere front-end developers, help make a difference?</p>\n<p>We&rsquo;re typically asked to create a better consumer experience or help teams execute tasks more efficiently. But this time our target audience isn&rsquo;t encouraged to consume more or faster. So what can we do?</p>"},{"__typename":"TextSectionRecord","title":"Our solution: gamify picking up plastic litter","body":"<p>At De Voorhoede, we&rsquo;re a technology minded bunch. So we started with a technology based idea: can we automatically detect litter in a picture? It turns out we can! And not just that: we can detect if there&rsquo;s plastic in it, if you made a picture of a bottle, if you can see a brand name on it, and much more. How? We&rsquo;re leveraging <a href=\"https://cloud.google.com/vision/\">Google&rsquo;s Vision API</a>, a cloud service analysing images using machine learning. After a quick test we&rsquo;re convinced this idea could work. But a tech-y idea is still a way off from something that would help the Plastic Soup Surfer.</p>"},{"__typename":"ImageWithTextRecord","imageWithDescription":{"image":{"url":"https://www.datocms-assets.com/6524/1535460060-pick-up-10idea.jpg","alt":null,"width":1108,"height":797,"format":"jpg"},"description":"The idea: leverage machine learning to detect plastic litter","inverse":false}},{"__typename":"TextSectionRecord","title":"","body":"<p>The information we receive from Google Vision gives us power. It helps the Plastic Soup Surfer and partner <a href=\"https://www.litterati.org/\">Litterati</a> fight for more sustainable solutions. But we, as developers, can also use the data for something else: we can reward the litter pics you take with points based on what&rsquo;s in your picture. Or in other words: we can gamify picking up plastic! To accelerate our ideas into having a working app we organised a hackathon with the <a href=\"https://hike.one/\">digital product designers from Hike One</a> and the Plastic Soup Surfer himself.</p>"},{"__typename":"ImageWithTextRecord","imageWithDescription":{"image":{"url":"https://www.datocms-assets.com/6524/1535460065-1526629287-pick-up-10-idea-copy.png","alt":"Plastic soup - Merijn Tinga","width":575,"height":400,"format":"png"},"description":"Hackathon to kick-off the Pick Up 10 campaign","inverse":true}},{"__typename":"TextSectionRecord","title":"","body":"<p>It&rsquo;s amazing what a group of creative minds can do in a single day. Within hours 4 teams created a concept to challenge you, take pictures, connect the Google Vision API, come up with a reward system, celebrate achievements and trigger you to challenge your friends. At the end of the day we duct taped everything together, and presto! We had the prototype version of our app:</p>"},{"__typename":"ResponsiveVideoRecord","mute":false,"loop":false,"autoplay":false,"video":{"url":"https://vimeo.com/265601385","title":"A New Campaign - PickUp10","height":360,"width":640,"provider":"vimeo","providerUid":"265601385","thumbnailUrl":"https://i.vimeocdn.com/video/695812178_640.jpg"}},{"__typename":"TextSectionRecord","title":"","body":"<p>Going from prototype to finished app was a breeze. Thanks to the prototype, we already knew all the hard technical parts and interaction patterns. We could now focus on building a robust app and didn&rsquo;t have to worry about feasibility or if it would feel &lsquo;right&rsquo; at the end. We created a backlog, built a solid API implementation, refined the user flow, added some addictive sprinkles and here we are: Pick up 10 is done! We hope our efforts inspire you to pick up as many plastic litter as you can for the sake of our oceans, and challenge your friends and family to do even better.</p>"},{"__typename":"ImageRecord","image":{"url":"https://www.datocms-assets.com/2850/1526629297-pick-up-10-screenshots.png","alt":null,"width":2384,"height":1412,"format":"png"},"alt":"Pick Up 10 screenshots","fullWidth":false}],"metaData":{"expertisesTitle":"Expertise","expertises":[{"title":"Development"},{"title":"Prototyping"}],"deliverableTitle":"Deliverables","deliverables":[{"title":"Progressive web app"}],"technologiesTitle":"Technologies","technologies":[{"title":"Nuxt.js"},{"title":"Vue.js"},{"title":"Google Vision API"}],"interestedTitle":"See result","interestedLinkUrl":"https://www.pickup10.org/","interestedLinkLabel":"www.pickup10.org"},"quote":"","author":"","getInTouchTitle":"Get in touch"},"pivots":[]}