{"page":{"title":"RTL Weekend Magazine","slug":"rtl-weekend-magazine","i18nSlugs":[{"locale":"en","value":"rtl-weekend-magazine"},{"locale":"nl","value":"rtl-weekend-magazine"}],"social":{"title":"RTL Weekend Magazine | De Voorhoede","description":"Door gebruik te maken van slimme technieken vertalen we het succes van de RTL Weekend Magazine app door naar het web","image":null},"keywords":"","heroIllustration":{"url":"https://www.datocms-assets.com/6524/1539870467-rtl-weekend-magazine.svg","format":"svg","alt":"rtl magazine"},"caseTeaser":{"title":"Van app naar web","image":{"url":"https://www.datocms-assets.com/6524/1539870701-rtl-weekend-magazine.png","format":"png","alt":null,"width":1988,"height":1241}},"content":[{"__typename":"TextSectionRecord","title":"De uitdaging: het succes van de app vertalen naar het web","body":"<p>De RTL Weekend Magazine App, ontwikkeld voor tablets, is een populaire app. RTL Nieuws vroeg De Voorhoede dit succes door te vertalen naar het web, zodat het voor een nog breder publiek beschikbaar is.</p>\n<p>De luxe uitstraling en de prettige gebruikerservaring hebben bijgedragen aan het succes van de tablet app. Dezelfde beleving willen we behouden met de vertaalslag naar het web. Zo verzekeren we bezoekers van dezelfde kwaliteit en houden zij het bekende, vertrouwde gevoel.</p>\n<p>Bezoekers van de nieuwe website gebruiken de meest uiteenlopende apparaten. Voor al deze apparaten moet de content altijd beschikbaar zijn en goed getoond worden. Bezoekers kunnen onderweg zijn en hierdoor te maken hebben met bijvoorbeeld een langzame, dure of instabiele internetverbinding. Met zo min mogelijk middelen zo snel mogelijk de inhoud te tonen is dan van essentieel belang: de vertrouwde ervaring moet op elke apparaat en op elke plek zoveel mogelijk behouden blijven.</p>"},{"__typename":"TextSectionRecord","title":"De oplossing: een responsive website","body":"<p>Met de juiste combinatie van kleuren, iconen en afbeeldingen is het vertrouwde gevoel van de app overgebracht naar de website. Door slim gebruik te maken van media queries en de functionaliteiten die tegenwoordig in (mobiele) browsers zitten, hebben we een website gemaakt die op een breed scala van apparaten werkt.</p>"},{"__typename":"ImageRecord","image":{"url":"https://www.datocms-assets.com/6524/1539870976-rtl-weekend-magazine-devices.jpg","alt":null,"width":3862,"height":1523,"format":"jpg"},"alt":"RTL Weekend Magazine","fullWidth":false},{"__typename":"TextSectionRecord","title":"","body":"<p>Omdat moderne browsers en mobiele apparaten tegenwoordig over moderne technieken beschikken, zijn we niet meer afhankelijk van extra bibliotheken of plugins. Hierdoor kunnen we de grootte van de website minimaal houden en er voor zorgen dat zelfs op tragere internetverbindingen de site snel beschikbaar is.</p>\n<p>Afbeeldingen zijn vaak de grootste bottleneck. Om de beste kwaliteit te bieden, zelfs op grote schermen, moeten vaak zware bestanden worden in geladen. Met het gebruik van technieken als <code>scrset</code> en het passief laden van afbeeldingen (op het moment dat ze bijna in beeld verschijnen) hebben we kunnen zorgen voor de optimale verhouding tussen kwaliteit en laadtijd.</p>"}],"metaData":{"expertisesTitle":"Expertises","expertises":[{"title":"Development"}],"deliverableTitle":"Deliverables","deliverables":[{"title":"Web app"}],"technologiesTitle":"Platforms","technologies":[{"title":"Gulp"},{"title":"Nunjucks"}],"interestedTitle":"","interestedLinkUrl":"","interestedLinkLabel":""},"quote":"","author":"","getInTouchTitle":"Neem contact op"},"pivots":[]}