{"page":{"title":"NPO Dashboard","slug":"npo-dashboard","i18nSlugs":[{"locale":"en","value":"npo-dashboard"},{"locale":"nl","value":"npo-dashboard"}],"social":{"title":"NPO Dashboard | De Voorhoede","description":"A big data dashboard for the editorial staffs of NPO and NOS, developed with Agile Kanban methods","image":null},"keywords":"npo, big data, analytics, statistics, d3, d3.js, riot, riotjs, kanban, iterative, analysis, dashboard, diagram, chart, nos","heroIllustration":{"url":"https://www.datocms-assets.com/6524/1539866631-npo-dashboard.svg","format":"svg","alt":"npo dashboard"},"caseTeaser":{"title":"Clear-cut insights in realtime visitor statistics","image":{"url":"https://www.datocms-assets.com/6524/1539866786-npo-topspin-scrum.jpg","format":"jpg","alt":null,"width":1440,"height":812}},"content":[{"__typename":"TextSectionRecord","title":"","body":"<p>Within the Dutch Public Broadcasting (NPO) a project was started in 2015 to develop a number of pilots based on &lsquo;big data&rsquo;. One of those pilots was the development of a dashboard for editorial staff to get <strong>direct insight into visitor/viewer statistics and trends</strong> <a href=\"http://cleverlions.com/\" target=\"_blank\" rel=\"noopener\">CleverLions</a>, the contractor of this project, asked us to build this configurable dashboard.</p>"},{"__typename":"TextSectionRecord","title":"The challenge: build a prototype based on complex data","body":"<p>The NPO is a complex media organisation. Not just television programmes are produced here, it&rsquo;s also the home of the NOS news station and hosts numerous message boards that draw large visitor numbers. Each of their editorial staffs uses distinct software. Sometimes featuring a modern API, sometimes none at all. <strong>Getting access to its data is a big challenge</strong>.</p>\n<p>NPO wants to provide all staff with a dashboard that displays similar information (visitor numbers, social network shares, trending posts, et cetera) we need an API that normalises all variations. Text called <code>header</code>in one instance and <code>caption</code> in the other will be named <code>title</code> in our API. More importantly, all this data needs to be as <em>realtime</em> as possible. Only when a trend develops literally before their eyes, the editorial staff can intervene or engage on time.</p>"},{"__typename":"ImageWithTextRecord","imageWithDescription":{"image":{"url":"https://www.datocms-assets.com/6524/1539867055-npo-topspin-graph.jpg","alt":null,"width":1024,"height":420,"format":"jpg"},"description":"This graph shows the daily progress of visitor numbers. The orange line is the actual number, the black line represents an estimation and the grey area is the estimation’s bandwidth.","inverse":false}},{"__typename":"TextSectionRecord","title":"","body":"<p>To give insight into this data, we need a <strong>balance between scanability and the amount of information present</strong> on the dashboard at once. To achieve this, we used recognisable iconography, photos, diagrams and pie charts.</p>\n<p>Finally, this was all about building a prototype: we aimed to learn about the NPO&rsquo;s data flow and be able to work out ideas quickly.</p>\n<p>Together with <a href=\"https://www.godatadriven.com/\" target=\"_blank\" rel=\"noopener\">GoDataDriven</a>&rsquo;s big data experts and <a href=\"https://hike.one/\" target=\"_blank\" rel=\"noopener\">Hike One</a>&rsquo;s designers we took off.</p>"},{"__typename":"TextSectionRecord","title":"The solution: work iteratively and demand driven","body":"<p>An important part of the dashboard is that it would become <em>actionable</em> for editorial staffs. On the other hand we had a heap of data begging us to experiment with it. By continuously asking questions, do a lot of demos and write flexible code we kept our focus.</p>"},{"__typename":"ImageWithTextRecord","imageWithDescription":{"image":{"url":"https://www.datocms-assets.com/6524/1539866786-npo-topspin-scrum.jpg","alt":null,"width":1440,"height":812,"format":"jpg"},"description":"In this project, we followed the Agile Kanban work method","inverse":true}},{"__typename":"TextSectionRecord","title":"API built to fit the front-end","body":"<p>The largest challenges were mainly in the back-end: getting data accessible, normalisation, analytics and building an API for the front-end. What that API should be is probably best dictated by what is displayed on the dashboard. Because data access was a complex issue, we decided to be very selective. We had many discussions with back-end developers about what information should be available in which format. Besides achieving our goal, we made the front-end<strong> fast, because the API was perfectly cut to size</strong>.</p>"},{"__typename":"TextSectionRecord","title":"Microframework for quick iterations","body":"<p>To be able to develop quickly, it&rsquo;s a good idea to choose something off the shelf without compromising development velocity. We chose <a href=\"http://riotjs.com/\" target=\"_blank\" rel=\"noopener\">Riot</a>: optimised for modular development and very flexible. We made sure every part of a page can update itself with newly available data. Titles, layout and positioning of statistics and lists on the page are configurable. To complete the dashboard, we built a &lsquo;TV mode&rsquo; version with large graphics on a dark background, specially suited for large screens in editorial offices.</p>\n<p>With this approach, we were able to quickly <strong>experiment with the information displayed</strong>.</p>"},{"__typename":"TextSectionRecord","title":"Visual is better","body":"<p>People are very visually oriented. To show that one article is doing better than the next, we display them in an ordered list. If Facebook is getting more shares than Twitter, that&rsquo;s immediately insightful with a pie chart diagram.</p>"},{"__typename":"ImageWithTextRecord","imageWithDescription":{"image":{"url":"https://www.datocms-assets.com/6524/1539867216-npo-topspin-dashboard.jpg","alt":null,"width":1024,"height":420,"format":"jpg"},"description":"To the left the dashboard with visitor numbers and popularity of two ‘top stories’; to the right a detail page with social media stats.","inverse":false}},{"__typename":"TextSectionRecord","title":"","body":"<p>In an early iteration, we mostly used text and red or green-colored percentages. As the project progressed, we decided to switch to stronger visualisation. With D3.js we were able to <strong>quickly show charts, diagrams and &lsquo;sparklines&rsquo;</strong>. This made things a lot more clear.</p>\n<p>In July 2016 the TopSpin project came to its conclusion with a large presentation, and the birth of a new department. This department is responsible for big data and datavisualisation solutions within NPO. We are proud to have contributed to this result.</p>"}],"metaData":{"expertisesTitle":"Expertises","expertises":[{"title":"Development"},{"title":"Prototyping"}],"deliverableTitle":"Deliverables","deliverables":[{"title":"Dashboard"}],"technologiesTitle":"Technologies","technologies":[{"title":"RiotJS"},{"title":"D3.js"}],"interestedTitle":"","interestedLinkUrl":"","interestedLinkLabel":""},"quote":"","author":"","getInTouchTitle":"Get in touch"},"pivots":[]}