{"page":{"title":"Commtrac","slug":"commtrac","i18nSlugs":[{"locale":"en","value":"commtrac"},{"locale":"nl","value":"commtrac"}],"social":{"title":"Commtrac | De Voorhoede","description":"Our solution for managing shipping terminals in the browser: visual, realtime, and modular","image":null},"keywords":"shipping terminal, docks, harbor, software, DBIS, commtrac, interface, realtime, modular, angular, angularjs","heroIllustration":{"url":"https://www.datocms-assets.com/6524/1539938877-commtrac.svg","format":"svg","alt":"commtrac"},"caseTeaser":{"title":"Manage ship terminals worldwide in a web browser","image":{"url":"https://www.datocms-assets.com/6524/1539939018-commtrac-ship.jpg","format":"jpg","alt":null,"width":1200,"height":515}},"content":[{"__typename":"TextSectionRecord","title":"","body":"<p>Commtrac is a software package by DBIS that is used to manage shipping terminals. To be specific: terminals that process bulk and general cargo. Think of coal, corn, iron ore, automobiles, paper bales, et cetera.</p>"},{"__typename":"TextSectionRecord","title":"The challenge: from Windows desktop to web","body":"<p>With Commtrac, planning for cargo ships is organised, as well as loading, unloading and storage of cargo at terminals. It also includes a dashboard that displays various stats and graphs.</p>\n<p>The existing application had become outdated and was only available for Windows. Up until then, it had grown organically and consisted mostly of input forms built on top of large data tables. This impeded maintenance and development of new features. The user interface also suffered: the learning curve for new employees and its ease of use were not ideal.</p>\n<p>DBIS wished to renew the application. Our assignment was to implement a simplified application structure. This way, the unique workflow for every employee would be better supported with <strong>clear overviews and intuitive input controls</strong>.</p>"},{"__typename":"ImageWithTextRecord","imageWithDescription":{"image":{"url":"https://www.datocms-assets.com/6524/1539939224-commtrac-cargo.jpg","alt":null,"width":1024,"height":449,"format":"jpg"},"description":"A crane operator, who is actually placing cargo in the ship’s hold, now has a tangible overview","inverse":false}},{"__typename":"TextSectionRecord","title":"The solution: visual and modular with a web application","body":"<p>By leaving the Windows desktop environment behind and moving towards a web application, we immediately met a couple of requirements:</p>\n<ul>\n<li>All data is stored centrally</li>\n<li>Employees don&rsquo;t need to install software on their work station and will always be <strong>up to date with the latest version</strong></li>\n<li>The application can be used on a variety of devices, including mobile</li>\n</ul>"},{"__typename":"StorytellingBlockRecord","storyItem":{"title":"The most important improvements of the new Commtrac:","items":[{"title":"Strongly visually oriented interface","body":"<p><span>The user interface has been revamped and all screens have been redesigned. The loading and unloading of ships, for instance, has been graphically visualised. This way, the operator has a good view on what cargo is located anywhere in the ship during unloading. When loading, the operator can drag cargo directly from a work list into the cargo hold of the ship.</span></p>","image":null},{"title":"Complex relations managed smoothly","body":"<p><span>The basis of our web application is AngularJS. A lot of forms are present in the application that can be very expansive and complicated. As an example: different input fields can have various limiting relationships. This means that when you have entered something in one input field, this might influence the options you have in another field. These&nbsp;</span><strong>rapidly evolving complex relationships can be managed well</strong><span>&nbsp;using AngularJS.</span></p>","image":null},{"title":"Scalability and customisation","body":"<p>The application is built entirely out of components. A component is a small part with its own logic and layout, that can be placed in a new screen independently of other components. Together they are able to form a new component or a screen that didn&rsquo;t exist before.</p>\n<p>This means that DBIS can easily build new forms and screens themselves. Now Commtrac can be<span>&nbsp;</span><strong>adapted to the wants and needs of any terminal</strong>.</p>","image":null}]}},{"__typename":"ImageWithTextRecord","imageWithDescription":{"image":{"url":"https://www.datocms-assets.com/6524/1539939240-commtrac-dashboard.jpg","alt":null,"width":1046,"height":408,"format":"jpg"},"description":"Another advantage is that AngularJS makes it easy to store and retrieve information directly while using the application. This way, what’s on the screen is always live.","inverse":false}}],"metaData":{"expertisesTitle":"Expertises","expertises":[{"title":"Development"}],"deliverableTitle":"Deliverables","deliverables":[{"title":"Web app"}],"technologiesTitle":"Technologies","technologies":[{"title":"AngularJS"},{"title":"D3.js"}],"interestedTitle":"","interestedLinkUrl":"","interestedLinkLabel":""},"quote":"","author":"","getInTouchTitle":"Get in touch"},"pivots":[]}